{"meta":{"title":"Fik-r","subtitle":"","description":"","author":"Fikr Lazuardi","url":"http://yoursite.com","root":"/"},"pages":[{"title":"About","date":"2020-04-04T08:15:14.000Z","updated":"2020-04-04T08:36:10.000Z","comments":true,"path":"about/index.html","permalink":"http://yoursite.com/about/index.html","excerpt":"","text":"Oke kenalin gua Fikr Lazuardi Islah, penulis dari blog gajelas yang isinya suka2 penulis meskipun gua yakin yang liat blog ini paling cuman penulisnya sendiri.Kerja sebagai Software Engineer.Certified Associate Android Developer.Penerima beasiswa Google Developer Kejar 2019 dari Google Authorized Training Partner.Express.js &amp; Vue.js EnthusiastGitu aja sih penjelasan singkat tentang gua, ya gua tau ga penting. Biar halamannya ga kosong aja ehehe"}],"posts":[{"title":"i3wm, Desktop environtment buat kaum yang mager tapi produktif","slug":"i3-desktop-environtment-buat-kaum-yang-mager","date":"2020-04-04T07:02:56.000Z","updated":"2020-04-04T08:11:42.000Z","comments":true,"path":"2020/04/04/i3-desktop-environtment-buat-kaum-yang-mager/","link":"","permalink":"http://yoursite.com/2020/04/04/i3-desktop-environtment-buat-kaum-yang-mager/","excerpt":"","text":"Jadi gua mau share bagus dan buruk dari pengalaman gua pake de ini yang kurang lebih udah 6 bulanan. Buat kalian yang gasuka baca dokumentasi atau oprek2, de ini sangat engga gua sarankan. Ya karena engga newbie friendly.Oke kita mulai dariBagusnya apa sih?LightweightCocok banget buat pc/laptop kalian yang kentang karna ga makan banyak memori.Screen real estateGausah khawatir soal window positioning karna i3 bakal nata window kalian secara otomatis.Butuh space window lebih banyak untuk program tertentu? pake fitur fullscreen atau layout yang beda misalnya tab.Keyboard-driven workflowBuat kalian yang males gerakin mouse/touchpad kayak gua ga usah khawatir karna pake keyboard aja sebenernya udah bisa ngelakuin banyak hal asal hapal dan ngerti shortcutnya. Misalnya kayak resizing window, pindah ke fokus ke program lain, ganti layout, buka terminal, buka browser dan masih banyak lainnya. Jadi kalian ga perlu pindah2 dari keyboard ke mouse dan bisa fokus sama kerjaan. Ini jadi benefit utama kenapa gua lebih suka pakai i3wm daripada de yang lain.ConfigurableKalian bisa atur desktop suka2 kalian. Mulai dari keyboard shortcut, workspace, bahkan tampilan yang super boring jadi cakep abis. Misalnya punya si u/Flag_Red[i3-gaps] Inspired by brutalism from r/unixpornGimana cakep kan? tadinya mau gua kasih screenshot desktop gua, tapi laptop nya lagi dipinjem orangkalau previewnya ga tampil coba pake vpn dulu.Kalau jeleknya gimana?Learning curve tinggiKalau kalian ga doyan baca dokumentasi dan males cari2 di forum dan lebih suka yang easy to use lebih disarankan pakai xfce kalau laptop kalian kentang. Soalnya kalau engga gitu gua yakin buka browser buat browsingan aja bakal kesulitan soalnya ga ada shortcut icon yang bisa di klik wkwk dan ga bisa dapet benefit maksimal dari i3wm ini.Udah gitu aja sih..","categories":[],"tags":[{"name":"i3","slug":"i3","permalink":"http://yoursite.com/tags/i3/"},{"name":"linux","slug":"linux","permalink":"http://yoursite.com/tags/linux/"},{"name":"de","slug":"de","permalink":"http://yoursite.com/tags/de/"}]},{"title":"Alasan murtad ke kotlin dari java","slug":"alasan-murtad-ke-kotlin-dari-java","date":"2020-04-04T04:52:11.000Z","updated":"2020-04-04T08:08:24.000Z","comments":true,"path":"2020/04/04/alasan-murtad-ke-kotlin-dari-java/","link":"","permalink":"http://yoursite.com/2020/04/04/alasan-murtad-ke-kotlin-dari-java/","excerpt":"","text":"Awal sebelum gua kenal kotlin, bahasa pemrograman yang biasa gua pakai buat develop android ya Java. Cuman lama kelamaan gua ngerasa penulisan kode di Java itu terlalu bertele-tele atau kepanjangan dan sering kali kena nullpointer exception sehingga aplikasi sering crash. Hingga akhirnya gua kenal dan memutuskan untuk murtad ke Kotlin. Nguli Ngoding jadi jauh lebih fun, cepet dan productive.Lebih ringkasYang artinya hanya butuh sedikit line code untuk solve suatu problem ketimbang menggunakan java. Tentu saja ini meningkatkan kualitas kode kita jadi lebih maintainability dan readability, yang artinya programmer bisa menulis, membaca, atau merubah code lebih efisien dan efektif.Bisa menggunakan semua Java framework dan library yang ada.Ga usah khawatir soal framwork atau library lagi karna semua java framework dan library compatible dengan kotlin.Mudah dipelajariBuat kalian yang udah sering gonta2 bahasa pemrograman atau pun baru migrasi dari java. Belajar kotlin udah pasti gampang banget. Karena Kotlin didesain untuk memakai elemen-elemen yang sudah ada dengan perbaikan dibagian tertentu sehingga proses ngoding menjadi lebih fun.Null SafetyKalian ga usah khawatir lagi soal NullPointerException di kotlin. Karena compiler akan mendeteksi adanya kemungkinan error sebelum membuat APK atau di run.Biar kalian makin mantap untuk murtad ke kotlin. coba liat video dibawahGitu aja sih. sewaktu waktu mungkin bakal gua tambah lagi. So See you next time :)","categories":[],"tags":[{"name":"Kotlin","slug":"Kotlin","permalink":"http://yoursite.com/tags/Kotlin/"}]},{"title":"Unixporn","slug":"unixporn","date":"2020-04-02T17:00:00.000Z","updated":"2020-04-04T08:12:46.000Z","comments":true,"path":"2020/04/03/unixporn/","link":"","permalink":"http://yoursite.com/2020/04/03/unixporn/","excerpt":"","text":"Buat kalian yang bosen dengan tampilan desktop yang gitu2 aja, kalian bisa cek r/unixporn. Kalian akan lihat banyak video/screenshot desktop cakep yang bisa kalian jadikan sebagai referensi. Selain screenshot aja biasanya si thread starter juga ngasih tau bahan2 apa aja yang mereka pake untuk ngeracik desktop mereka. Mantep ga tuh?Contohnya kayak gini nih.[Sway] ブラッククローバー Noelle from r/unixporn[i3-gaps] My rice from r/unixpornGimana ? Keren-keren kan?Selain liat-liat aja kalian juga bisa ikut nimbrung dan pamerin desktop kalian yang super boring cakep ke orang2 di komunitas unixporn biar mereka tau lo juga punya desktop yang ga kalah cakep juga hehe.Oh iya buat kalian yang engga bisa masuk ke reddit atau bahkan engga bisa lihat previewnya coba pake vpn dulu mungkin aja provider kalian ga ngebolehin kalian buka reddit misalnya kayak si telkomsel.Gitu aja kali ya. see you next time!","categories":[],"tags":[{"name":"linux","slug":"linux","permalink":"http://yoursite.com/tags/linux/"},{"name":"reddit","slug":"reddit","permalink":"http://yoursite.com/tags/reddit/"},{"name":"ui","slug":"ui","permalink":"http://yoursite.com/tags/ui/"}]},{"title":"Kenalan dengan npm - Part 1","slug":"Kenalan-dengan-npm","date":"2020-04-01T17:00:00.000Z","updated":"2020-04-04T08:12:46.000Z","comments":true,"path":"2020/04/02/Kenalan-dengan-npm/","link":"","permalink":"http://yoursite.com/2020/04/02/Kenalan-dengan-npm/","excerpt":"","text":"Buat kalian yang belum tau, npm itu singkatan dari node package manager. Salah satu tool yang otomatis terinstal ketika kalian menginstal Node.js yang fungsinya untuk mengatur package-package dependensi yang kita gunakan dalam project kita. Kembarannya kayak si composer yang untuk php, pip untuk python, dll. Di part ini gua ga akan bahas detail tentang npm ya, sekilas aja tentang commandnya seperti cara nerapin, install, remove, dll.Buat kalian yang belum install Node.js dan npm, install dulu deh. Kalian bisa lihat artikel ini bagi yang ga ngerti cara installnya - cara-install-node-jsQuickstartMenerapkan npm kedalam proyek yang sudah ada12$ cd folder-project$ npm initKalian enter terus aja gpp nanti akan keisi dengan nilai default. kalau udah yes, package.json akan otomatis tergenerate di projectmu.Menginstall npm packages1$ npm installSetelah jalanin perintah diatas akan ada folder baru yang namanya node_modules. Isi folder ini ya kumpulan package yang ada di package.json. Fungsi perintah tadi buat install semua package yang ada di dependencies pada package.json.Kalau mau install spesifik package yang ada di npmjs.com.1$ npm install &lt;package&gt; --saveMenghapus npm package dari project1$ npm uninstall &lt;package&gt;Secara otomatis package akan terhapus dari folder node_modules sekaligus di dependencies pada package.json.Menjalankan script1$ npm start &lt;script&gt;Nih gua kasih contoh lewat screenshot.Misal jalanin command npm start server.itu sama aja kayak kita jalanin perintah kayak gini1$ hexo serverlah kalau gitu kenapa ga langsung aja nulis kayak diatas? ya bayangin aja kalau commandnya panjang. Masa setiap mau running harus ngetik panjang lebar kayak gitu, ga efektif buat gua pribadi yang mageran hehe.Untuk part kali ini segini dulu aja ya. sekian terima kasih. :)","categories":[],"tags":[{"name":"node.js","slug":"node-js","permalink":"http://yoursite.com/tags/node-js/"},{"name":"tutorial","slug":"tutorial","permalink":"http://yoursite.com/tags/tutorial/"}]},{"title":"Panduan install Node.js ( Windows, MacOS, Arch Linux ) - Part 1","slug":"install-node-js","date":"2020-03-31T17:00:00.000Z","updated":"2020-04-04T08:12:26.000Z","comments":true,"path":"2020/04/01/install-node-js/","link":"","permalink":"http://yoursite.com/2020/04/01/install-node-js/","excerpt":"","text":"Node.js? apaan tuh? gua kasih tau sekilas deh. Jadi node.js itu platform buatan Ryan Dahl untuk menjalankan aplikasi web berbasis JavaScript yang dikenalkan pada tahun 2009. Dengan platform ini, kalian bisa jalanin javascript kalian dari sisi server. Gokil ga tuh? kalau dulu javascript cuman bisa dipake untuk bikin web jadi lebih interaktif. Tapi dengan Node.js ini lu bisa bikin CLI, desktop, chatbot, IoT dan masih banyak lainnya. nanti akan gua bahas lebih detail soal node.js di artikel selanjutnya. Disini gua mau ngasih tau caranya install dulu. Oke.Quick StartDownload Node.js InstallerDownload dulu di nodejs.org/en/download/Buat kalian yang pake windows bajakan kalian bisa download yang .msi kalau pake macOS pilih yang .pkgBuka Node.js InstallerKalian buka file yang udah di download tadi. Kemudian next-next aja terus sampe finish. Kayak screenshot dibawah.Install di ArchLinux1$ sudo pacman -S nodejs npmCek InstalasiKalian buka terminal/cmd terus jalanin perintah dibawah.1234$ node -vv13.2.0$ npm -v6.13.1Kalau versi nya udah sesuai dengan yang kalian download/install berarti instalasi nya udah berhasil.Gampang kan?.","categories":[],"tags":[{"name":"node.js","slug":"node-js","permalink":"http://yoursite.com/tags/node-js/"},{"name":"tutorial","slug":"tutorial","permalink":"http://yoursite.com/tags/tutorial/"}]}],"categories":[],"tags":[{"name":"i3","slug":"i3","permalink":"http://yoursite.com/tags/i3/"},{"name":"linux","slug":"linux","permalink":"http://yoursite.com/tags/linux/"},{"name":"de","slug":"de","permalink":"http://yoursite.com/tags/de/"},{"name":"Kotlin","slug":"Kotlin","permalink":"http://yoursite.com/tags/Kotlin/"},{"name":"reddit","slug":"reddit","permalink":"http://yoursite.com/tags/reddit/"},{"name":"ui","slug":"ui","permalink":"http://yoursite.com/tags/ui/"},{"name":"node.js","slug":"node-js","permalink":"http://yoursite.com/tags/node-js/"},{"name":"tutorial","slug":"tutorial","permalink":"http://yoursite.com/tags/tutorial/"}]}